УТ_для_edt/src/InformationRegisters/CRM_Напоминания/CRM_Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_Напоминания</name>
  <comment>Данный регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</comment>
  <resources>
    <name>ДатаАктуальности</name>
    <comment>Дата до которой напоминание считается актуальным. Не актуальные напоминания удаляются.</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Содержание</name>
    <comment>Содержание напоминания - сообщение содержащее суть напоминания.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <comment>Важность</comment>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Счетчик</name>
    <comment>Содержит число, показывающее, сколько раз напоминание было отложено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОповещения</name>
    <type>
      <types>CatalogRef.CRM_ВидыОповещений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <comment>Получатель  напоминания</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <comment>Ссылка на объект конфигурации прилагаемый к напоминанию</comment>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <comment>Дата напоминания (для нового равно дате оповещения)</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОповещения</name>
    <comment>Дата напоминания +  отсрочка (срок на который пользователь отложил напоминание)  </comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/CommonModules/CRM_НапоминанияКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Напоминания клиент
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура для вывода активных напоминаний.
//
// Параметры:
//  НеОткрыватьДляРабочегоСтола	 - Булево - Не открывать для рабочего стола.
//
Процедура ВывестиАктивныеНапоминания(НеОткрыватьДляРабочегоСтола = Истина) Экспорт
 	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания();
	// +Рабочий стол
	РабочийСтолАктивен = Ложь;
	Если ск_глСтекФормРабочегоСтола <> Неопределено Тогда
		Для Каждого ФормаРабочегоСтола Из ск_глСтекФормРабочегоСтола Цикл
			Если ФормаРабочегоСтола.Значение.Открыта() И ФормаРабочегоСтола.Значение.Элементы.Найти("скПолеHTMLНапоминаний")<>Неопределено Тогда
				CRM_РабочийСтолКлиент.ОбновитьТаблицуНапоминаний(ФормаРабочегоСтола.Значение, МассивНапоминаний);
				РабочийСтолАктивен = Истина
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Если НеОткрыватьДляРабочегоСтола И РабочийСтолАктивен Тогда
		Возврат;
	КонецЕсли;
	// -Рабочий стол
#Если ВебКлиент Тогда
	ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
#Иначе	
	Если ГлФормаНапоминанийCRM = Неопределено Тогда
		ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
	КонецЕсли;
#КонецЕсли
	
	Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНовыхНапоминаний = Новый Структура("ПрочиеНапоминания");
	СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
	
	ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
КонецПроцедуры // ВывестиАктивныеНапоминания()

// Функция формирования ключа записи по строке.
//
// Параметры:
//	Строка	- Строка	- Строка с ключом записи.
//
// Возвращаемое значение:
//	Структура	- Ключ записи
//
Функция СформироватьКлючЗаписиПоСтроке(Строка) Экспорт
	Ключ = Новый Структура();
	Ключ.Вставить("Пользователь",	Строка.Пользователь);
	Ключ.Вставить("Предмет",		Строка.Предмет);
	Если ТипЗнч(Строка.Предмет) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") И ЗначениеЗаполнено(Строка.ВидОповещения) Тогда
		Ключ.Вставить("Содержание",		Строка.Содержание);
	Иначе	
		Ключ.Вставить("ДатаНачала",		Строка.ДатаНачала);
		Ключ.Вставить("ДатаОповещения",	Строка.ДатаОповещения);
	КонецЕсли;
	Возврат Ключ;
КонецФункции // СформироватьКлючЗаписиПоСтроке()

// подключает обработчик оповещения о входящих письмах.
//
// Параметры:
//  ЗапуститьСразу	 - Булево - Запустить сразу. 
//
Процедура ПодключитьОбработчикОповещенияВходящиеПисьма(ЗапуститьСразу = Ложь) Экспорт
	
	// Получим период обновления напоминаний из настроек параметров учета.
	ВходящиеПисьмаПериодОбновления = CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминанийОВходящихПисьмах();
	
	Если ВходящиеПисьмаПериодОбновления > 0 Тогда
		
		Если ЗапуститьСразу Тогда
		
			ВывестиАктивныеНапоминанияОВходящихПисьмах();	
		
		КонецЕсли;		
		
		ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах", ВходящиеПисьмаПериодОбновления);
		
	КонецЕсли;	
	
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()
	
//  Подключает обработчик оповещения о входящих письмах.
//
Процедура ОтключитьОбработчикОповещенияВходящиеПисьма() Экспорт
	
	ОтключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах");
		
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик события "ПриНачалеРаботыСистемы".
//
// Параметры:
//	Нет.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если Не CRM_НапоминанияСервер.ИспользуютсяНапоминания() Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиАктивныеНапоминания();
	
	ПериодОбновления = CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминаний();
	ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминания", ПериодОбновления);
	ПодключитьОбработчикОповещенияВходящиеПисьма(Истина);
	
КонецПроцедуры

// Процедура для вывода активных напоминаний.
//
// Параметры:
//	Нет.
//
Процедура ВывестиАктивныеНапоминанияОВходящихПисьмах() Экспорт
 	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания(Истина);
#Если ВебКлиент Тогда
	ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
#Иначе	
	Если ГлФормаНапоминанийCRM = Неопределено Тогда
		ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
	КонецЕсли;
#КонецЕсли	
	Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
		Возврат;
	КонецЕсли;
	СтруктураНовыхНапоминаний = Новый Структура("НапоминанияОВходящихПисьмах");
	СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
	ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
КонецПроцедуры // ВывестиАктивныеНапоминания()

#Область ОбработчикиКоманд

Процедура ОткрытьФормуНапоминания(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Содержание", ПараметрКоманды);
	ПараметрыФормы.Вставить("Предмет", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.CRM_Напоминания.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры// ОткрытьФормуНапоминаний() Экспорт
	
#КонецОбласти

#КонецОбласти
